Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/include/component/adc.h
#define ADC_PFFDATA_PFFDATA_Pos               _UINT32_(0)                                          /* (ADC_PFFDATA) SARCORE Conversion data from the APB FIFO Position */
#define ADC_PFFDATA_PFFDATA_Msk               (_UINT32_(0xFFFF) << ADC_PFFDATA_PFFDATA_Pos)        /* (ADC_PFFDATA) SARCORE Conversion data from the APB FIFO Mask */
#define ADC_PFFDATA_PFFDATA(value)            (ADC_PFFDATA_PFFDATA_Msk & (_UINT32_(value) << ADC_PFFDATA_PFFDATA_Pos)) /* Assigment of value for PFFDATA in the ADC_PFFDATA register */
#define ADC_PFFDATA_PFFCHNID_Pos              _UINT32_(16)                                         /* (ADC_PFFDATA) Channel ID from APB FIFO Position */
#define ADC_PFFDATA_PFFCHNID_Msk              (_UINT32_(0xF) << ADC_PFFDATA_PFFCHNID_Pos)          /* (ADC_PFFDATA) Channel ID from APB FIFO Mask */
#define ADC_PFFDATA_PFFCHNID(value)           (ADC_PFFDATA_PFFCHNID_Msk & (_UINT32_(value) << ADC_PFFDATA_PFFCHNID_Pos)) /* Assigment of value for PFFCHNID in the ADC_PFFDATA register */
#define ADC_PFFDATA_PFFCORID_Pos              _UINT32_(20)                                         /* (ADC_PFFDATA) Core ID from APB FIFO Position */
#define ADC_PFFDATA_PFFCORID_Msk              (_UINT32_(0x3) << ADC_PFFDATA_PFFCORID_Pos)          /* (ADC_PFFDATA) Core ID from APB FIFO Mask */
#define ADC_PFFDATA_PFFCORID(value)           (ADC_PFFDATA_PFFCORID_Msk & (_UINT32_(value) << ADC_PFFDATA_PFFCORID_Pos)) /* Assigment of value for PFFCORID in the ADC_PFFDATA register */
#define ADC_PFFDATA_PFFSIGN_Pos               _UINT32_(22)                                         /* (ADC_PFFDATA) Channel Sign from the APB FIFO Position */
#define ADC_PFFDATA_PFFSIGN_Msk               (_UINT32_(0x1) << ADC_PFFDATA_PFFSIGN_Pos)           /* (ADC_PFFDATA) Channel Sign from the APB FIFO Mask */
#define ADC_PFFDATA_PFFSIGN(value)            (ADC_PFFDATA_PFFSIGN_Msk & (_UINT32_(value) << ADC_PFFDATA_PFFSIGN_Pos)) /* Assigment of value for PFFSIGN in the ADC_PFFDATA register */
#define ADC_PFFDATA_PFFFRACT_Pos              _UINT32_(23)                                         /* (ADC_PFFDATA) Fractional Setting from APB FIFO Position */
#define ADC_PFFDATA_PFFFRACT_Msk              (_UINT32_(0x1) << ADC_PFFDATA_PFFFRACT_Pos)          /* (ADC_PFFDATA) Fractional Setting from APB FIFO Mask */
#define ADC_PFFDATA_PFFFRACT(value)           (ADC_PFFDATA_PFFFRACT_Msk & (_UINT32_(value) << ADC_PFFDATA_PFFFRACT_Pos)) /* Assigment of value for PFFFRACT in the ADC_PFFDATA register */
#define ADC_PFFDATA_PFFCNT_Pos                _UINT32_(24)                                         /* (ADC_PFFDATA) Current Data Entries in APB FIFO Position */
#define ADC_PFFDATA_PFFCNT_Msk                (_UINT32_(0xFF) << ADC_PFFDATA_PFFCNT_Pos)           /* (ADC_PFFDATA) Current Data Entries in APB FIFO Mask */
#define ADC_PFFDATA_PFFCNT(value)             (ADC_PFFDATA_PFFCNT_Msk & (_UINT32_(value) << ADC_PFFDATA_PFFCNT_Pos)) /* Assigment of value for PFFCNT in the ADC_PFFDATA register */
#define ADC_PFFDATA_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ADC_PFFDATA) Register Mask  */


/* -------- ADC_DMABASE : (ADC Offset: 0xDC) (R/W 32) DMA Sample Base Address -------- */
#define ADC_DMABASE_RESETVALUE                _UINT32_(0x00)                                       /*  (ADC_DMABASE) DMA Sample Base Address  Reset Value */

#define ADC_DMABASE_DMABASE_Pos               _UINT32_(0)                                          /* (ADC_DMABASE) DMA Sample Value Base Address Position */
#define ADC_DMABASE_DMABASE_Msk               (_UINT32_(0xFFFFFFFF) << ADC_DMABASE_DMABASE_Pos)    /* (ADC_DMABASE) DMA Sample Value Base Address Mask */
#define ADC_DMABASE_DMABASE(value)            (ADC_DMABASE_DMABASE_Msk & (_UINT32_(value) << ADC_DMABASE_DMABASE_Pos)) /* Assigment of value for DMABASE in the ADC_DMABASE register */
#define ADC_DMABASE_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ADC_DMABASE) Register Mask  */


/* -------- ADC_DMACTRL : (ADC Offset: 0xE0) (R/W 32) DMA Control Register -------- */
#define ADC_DMACTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (ADC_DMACTRL) DMA Control Register  Reset Value */

#define ADC_DMACTRL_DMAEN_Pos                 _UINT32_(1)                                          /* (ADC_DMACTRL) DMA Enable Position */
#define ADC_DMACTRL_DMAEN_Msk                 (_UINT32_(0x1) << ADC_DMACTRL_DMAEN_Pos)             /* (ADC_DMACTRL) DMA Enable Mask */
#define ADC_DMACTRL_DMAEN(value)              (ADC_DMACTRL_DMAEN_Msk & (_UINT32_(value) << ADC_DMACTRL_DMAEN_Pos)) /* Assigment of value for DMAEN in the ADC_DMACTRL register */
#define ADC_DMACTRL_DMACR_Pos                 _UINT32_(4)                                          /* (ADC_DMACTRL) DMA CORE Enables Position */
#define ADC_DMACTRL_DMACR_Msk                 (_UINT32_(0xF) << ADC_DMACTRL_DMACR_Pos)             /* (ADC_DMACTRL) DMA CORE Enables Mask */
#define ADC_DMACTRL_DMACR(value)              (ADC_DMACTRL_DMACR_Msk & (_UINT32_(value) << ADC_DMACTRL_DMACR_Pos)) /* Assigment of value for DMACR in the ADC_DMACTRL register */
#define ADC_DMACTRL_DMABL_Pos                 _UINT32_(8)                                          /* (ADC_DMACTRL) DMA System RAM Buffer Length Position */
#define ADC_DMACTRL_DMABL_Msk                 (_UINT32_(0x7) << ADC_DMACTRL_DMABL_Pos)             /* (ADC_DMACTRL) DMA System RAM Buffer Length Mask */
#define ADC_DMACTRL_DMABL(value)              (ADC_DMACTRL_DMABL_Msk & (_UINT32_(value) << ADC_DMACTRL_DMABL_Pos)) /* Assigment of value for DMABL in the ADC_DMACTRL register */
#define ADC_DMACTRL_Msk                       _UINT32_(0x000007F2)                                 /* (ADC_DMACTRL) Register Mask  */


/* -------- ADC_PFFCTRL : (ADC Offset: 0xE4) (R/W 32) APB FIFO Control Register -------- */
#define ADC_PFFCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (ADC_PFFCTRL) APB FIFO Control Register  Reset Value */

#define ADC_PFFCTRL_PFFEN_Pos                 _UINT32_(1)                                          /* (ADC_PFFCTRL) APB FIFO Enable Position */
#define ADC_PFFCTRL_PFFEN_Msk                 (_UINT32_(0x1) << ADC_PFFCTRL_PFFEN_Pos)             /* (ADC_PFFCTRL) APB FIFO Enable Mask */
#define ADC_PFFCTRL_PFFEN(value)              (ADC_PFFCTRL_PFFEN_Msk & (_UINT32_(value) << ADC_PFFCTRL_PFFEN_Pos)) /* Assigment of value for PFFEN in the ADC_PFFCTRL register */
#define ADC_PFFCTRL_PFFCR_Pos                 _UINT32_(4)                                          /* (ADC_PFFCTRL) APB CORE FIFO Enable Position */
#define ADC_PFFCTRL_PFFCR_Msk                 (_UINT32_(0xF) << ADC_PFFCTRL_PFFCR_Pos)             /* (ADC_PFFCTRL) APB CORE FIFO Enable Mask */
#define ADC_PFFCTRL_PFFCR(value)              (ADC_PFFCTRL_PFFCR_Msk & (_UINT32_(value) << ADC_PFFCTRL_PFFCR_Pos)) /* Assigment of value for PFFCR in the ADC_PFFCTRL register */
#define ADC_PFFCTRL_PFFRDYDM_Pos              _UINT32_(16)                                         /* (ADC_PFFCTRL) DMA APB FIFO Data Ready Position */
#define ADC_PFFCTRL_PFFRDYDM_Msk              (_UINT32_(0x1) << ADC_PFFCTRL_PFFRDYDM_Pos)          /* (ADC_PFFCTRL) DMA APB FIFO Data Ready Mask */
#define ADC_PFFCTRL_PFFRDYDM(value)           (ADC_PFFCTRL_PFFRDYDM_Msk & (_UINT32_(value) << ADC_PFFCTRL_PFFRDYDM_Pos)) /* Assigment of value for PFFRDYDM in the ADC_PFFCTRL register */
#define   ADC_PFFCTRL_PFFRDYDM_CTLINTFLAG_PFFHFUL_Val _UINT32_(0x0)                                        /* (ADC_PFFCTRL) Selects CTLINTFLAG.PFFHFUL for the ADC DMA PFFRDY trigger signal to the DMAC  */
#define   ADC_PFFCTRL_PFFRDYDM_CTLINTFLAG_PFFRDY_Val _UINT32_(0x1)                                        /* (ADC_PFFCTRL) Selects CTLINTFLAG.PFFRDY for the ADC DMA PFFRDY trigger signal to the DMAC  */
#define ADC_PFFCTRL_PFFRDYDM_CTLINTFLAG_PFFHFUL (ADC_PFFCTRL_PFFRDYDM_CTLINTFLAG_PFFHFUL_Val << ADC_PFFCTRL_PFFRDYDM_Pos) /* (ADC_PFFCTRL) Selects CTLINTFLAG.PFFHFUL for the ADC DMA PFFRDY trigger signal to the DMAC Position  */
#define ADC_PFFCTRL_PFFRDYDM_CTLINTFLAG_PFFRDY (ADC_PFFCTRL_PFFRDYDM_CTLINTFLAG_PFFRDY_Val << ADC_PFFCTRL_PFFRDYDM_Pos) /* (ADC_PFFCTRL) Selects CTLINTFLAG.PFFRDY for the ADC DMA PFFRDY trigger signal to the DMAC Position  */
#define ADC_PFFCTRL_Msk                       _UINT32_(0x000100F2)                                 /* (ADC_PFFCTRL) Register Mask  */


